Tekla.Structures.Drawing.PlacingDirectionAttributes
The PlacingDirectionAttributes class contains the basic attributes for placing directions.

Tekla.Structures.Drawing.PlacingDirectionAttributes.Positive
The positive direction of placing.

Tekla.Structures.Drawing.PlacingDirectionAttributes.Negative
The negative direction of placing.

Tekla.Structures.Drawing.PlacingDirectionAttributes.#ctor
Creates a new placing direction attributes instance. The positive and negative
directions are set to false by default.

Tekla.Structures.Drawing.PlacingDirectionAttributes.#ctor(System.Boolean,System.Boolean)
Creates a new placing direction attributes instance.
positive: Sets the positive direction.
negative: Sets the negative direction.

Tekla.Structures.Drawing.PlacingDirectionAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.